#include<iostream>
using namespace std;

#pragma region 전처리기
/*
▶ 전처리기

- 실행 파일을 생성하는 과정에서 컴파일하기 직전, 소스 파일내에 존재하는 선행 처리 지시문을 처리하는 작업을 의미한다.

- 전처리기가 실행되면 각 코드 파일에서 지시자를 찾기 시작한다.
ㄴ 지시자는 #으로 시작으로 줄 바꿈으로 끝나는 코드

※ 선행 처리를 위한 명령에는 맨 앞에 #기호가 붙는다는 공통점이 있다.

▷ C/C++ 코드를 실행하는 과정

- 순서 : 전처리기 -> 컴파일러 -> 어셈블러 -> 링커

전처리기(Preprocessor)
ㄴ 헤더 파일 삽입, 코드의 주석 제거, 문법 검토, 매크로등을 치환(바꾸다)하는 역할을 수행한다.

컴파일러

어셈블러
ㄴ 어셈블리 코드를 기계어(0 or 1) 변환하여 오브젝트 파일을 생성한다.

링커
ㄴ 각각의 오브젝트 파일들을 묶어서 실행 코드 파일로 변환을 해준다.
*/
#pragma endregion